{
  "dev": [
    {
      "text": "Top story: RED LINE SYMPTOMS OF ACONITE | I LOVE HOMEOPATHY see more",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "while it 's genuinely cool to hear characters talk about early rap records ( sugar hill gang , etc. ) , the constant referencing of hip-hop arcana can alienate even the savviest audiences . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Ra has to be one of the most underrated band in rock music.When I heard their first cd I was blown away. These guys are amazing. The whole feel of this band is just is so different than anything I have heard in many years. This cd is really good and I would hope the world would sit up and take notice.These guys are talented musicians and in modern music that can be rare.The music is angery and powerful and then it is smooth and melodic.Tell Me, I lost everything today,The only one, and got me go",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "I bought this charger near the end of May of this year and it stopped working about 2 weeks ago. It is not the same charger as in the picture with the gray cord. It looks just like most of the other generic chargers available on Amazon. It charges quite slowly (ibook g4 14\"). I have a brand new APPLE brand battery, so I don't think it has anything to do with that or the computer. From now on I will stick with the cheaper generic chargers until my computer is totally dead.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "nelson 's brutally unsentimental approach ... sucks the humanity from the film , leaving behind an horrific but weirdly unemotional spectacle . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Love the book, has many recipes in it. I have used many of them and they not only taste good but do help u feel better",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "It was a great choice between BD and DVD, of course I bought the BD. As you all know the quality is far more better than regular DVD. The movie had a pretty good opening to and it was very catchy. Story has a pretty good plot to it but it wasn't as good as the first movie. there were more action on the first movie compared to this. All in all it was a great and fun movie to watch.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Stayed here for a long weekend for a friend's wedding in Mesa. Driving from Southern California, it was located conveniently near the freeway and parking was easy! Check in was a breeze, the receptionist was very friendly- he gave us two warm cookies and a map of the surrounding area to help us out. Looks a bit outdated from the outside, but don't judge a book by the cover- the rooms are definitely kept up very nicely! The room was so spacious! Upon entering, there is a couch that turns into a b",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "#Spurs #GoSpursGo 1997 Wheels Tim Duncan RC Rookie #Card Lot #TimDuncan #NBA",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Tim Duncan got ejected for laughing once. Steph got ejected for throwing a mouth piece. Boogie gets ejected for breathing. None for Beal?",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": ".@potus @user 50 yrs of embargo?  Didn't do a thing. TY for trying to change Cuba 4 the better.  #endembargo #endtheembargo",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "and that leaves a hole in the center of the salton sea . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Guy I've following your entire career & im a huge fan and was wondering if you'd be prepared to sing at my funeral.https://t.co/5BpuTMBEVe",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "if your taste runs to ` difficult ' films you absolutely ca n't miss it . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "The book wasn't as great as the reviews said it was. The explanation on many of the topics was sketchy and didn't have the detail I expected (e.g. AWT). It's probably a better book if you already know Java and are looking to catch some of the finer points. I don't recommend it for absolute beginners.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "I don't even know how they can call this pizza! The thin crust is like eating cardboard... disgusting",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "I'm here pretty regularly, since it is within walking distance of my house. Sometimes I feel like I'm paying a bit too much, but I've started frequenting the specials and Happy Hour menu, which has alleviated some of that. I've tried the sushi, the gyozo bowl, the salads, and some of the pasta dishes. Everything has been pretty good.\\n\\nThe gyozo bowl is awesome. It reminds me of the spicy Korean ramen my mom would make me with mondu (Korean dumplings). It's pretty spicy and flavorful. I love si",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "a simple , but gritty and well-acted ensemble drama that encompasses a potent metaphor for a country still dealing with its fascist past . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "This place was really busy when we arrived so it seemed promising. Some of the food was good and others were sub-par.\\n\\nTwo of us ate the gyro platter which comes with: \\nhummus (watery) \\npita (store bought) \\ngyro meat (I've never had gyro meat like this before, it was ultra thin and had a rubbery texture - also the portion was so small) \\nGreek salad (iceberg with sparse toppings and too much dressing) \\ngrape leaves (vegetarian but quite good) \\nand rice (actually this was the tastiest thin",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Please beware that this DVD that I purchased for use in the UK is the wrong region number. It was sold to me who live currently in the UK but it only works in region 1 DVD players which made me really unhappy to know that to watch it I need to change settings of my DVD player but it has to be watched at once because I won't be able to change settings again and again as the appliance can malfunction after that. The return policy should cover this type of problem and refund 100% in those cases. It",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "This translation of Marquez's quintessential work does great justice to his remarkable prose. The clarity and depth of Hundred Years' symbolism and the excellent development of the Buendia characters send the reader back to an austere but complicated time - a time of exploration, political upheaval, and social transition. One criticism of this translation is the absence of footnotes to specific historical, cultural, or social elements of life in Colombia in the past two centuries.\"Taciturn, sile",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "I like the price and quantity in the package but I'm noticing now that they are holding up overnight. I've recently changed to a more absorbent diaper at night.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "This place was noted as a \\\"\"must visit\\\"\" location during my last trip to Pittsburgh. I must say, it was definitely worth the visit. \\n\\nTo all reading this, be aware that essentially, this is just a grocery store we're talking about here. However, the rustic building, and kitchy offerings (like pour your own olive oil...or taste our 100cheeses) makes it kind of special. \\n\\nWhen I was given this recommendation, I was told \\\"\"head to the back to where the cheese is\\\"\". So, I did. WHOA - so much",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Internet Connection  = $60 \\nWi-Fi router = $120 \\nDaily internet pass = $4.95\\n\\nLosing customers because you make them pay for wifi access priceless.\\n\\n$4.95 for a day pass or $29.95 for a monthly pass is just ridiculous, especially when the place is so computer friendly with lots of a/c plugs for laptop users.\\n\\nIf you are going to just have coffee then miss I's review is right on the spot, but if you are going to work or study and need access to the internet then go somewhere else.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Loved this date, the food was pretty much what I anticipated as a fondue fan. I was floored however by their extensive dessert menu, where the flaming turtle using dark chocolate was the highlight of the meal. It will be in the potential date night rotation in the future.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "this book was recommend 2 me from my neighbor. but i dont think that dis is dat gud of a book 2 recommend... i didnt like it 2 much but...",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "Rats. I was all ready to buy this movie, but the ephemistic \"Full-screen format\" (i.e. Pan and Scan) stopped me cold. The reason I bought a DVD player in the first place, besides the great running commentaries included with many movies, is so I could see the entire image the director intended, not some cropped 4:3 editted-for-television version.Call me a purist, but I just don't buy cropped DVDs like this one.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "I booked a stay at Hotel San Carlos for one night through Groupon for $76 after taxes. Most other hotels in the area go for $120-300, so finding this deal was awesome. My boyfriend and I live in AZ and he wanted to celebrate his birthday by having a staycation downtown so we could have fun with family and friends without worrying about a way to get home at the end of the night. Originally, we were going to book a night at Hotel Palomar but like I said, we weren't looking to spend a lot of money.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "it ca n't decide if it wants to be a mystery/thriller , a romance or a comedy . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "...with two of my favorite actors: Mark Harmon and the lovely Madeline Stowe.I caught this on cable back in the early 90's. I had a big crush on Madeline Stowe, since seeing her in \"Revenge\". So I decided to check this out...and I was not disappointed.Definitely not a general classic, but I love this film. With less-capable and less-likeable actors, this film would (...). This is one of those rare cases where the actors elevate the material.This is one of those rainy-day, \"got-nothing-else-to-do",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Of Mice and Men by John Steinbeck was the best book I have ever read. The characters, the mentally retarded Lennie and the tough George, are on the run from people from Weed. Lennie was accused of trying to rape a girl in a red dress when he actually wanted to touch it since it was so soft. After that, they find a ranch in Salinas, California to work on for a while. There are conflicts and solutions all at the same time.My favorite character was Lennie because even though, he was really mentally",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Kate Upton & Justin Verlander -- To Hell With Cy Young ... It's Vatica #TrumpTransition #PresidentElectTrump #MAGA",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "@user @user It is wall to wall \"How to stop Trump,\" \"Trump's  racist,\" Cabinet is \"hellish,\" etc... pro-Russian? Absurd on face",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "No wonder this man won an American Music Award, a Billboard Music Award, and his single and album went platinum and double platinum! I bought this CD because I liked Invisible, because of Billboard saying it's the best pop CD of 2003, and because I figured he must be good if he won awards. I was so glad I bought it after I heard it! What a great album! It's so nice to hear someone with a great voice singing material that's not filled with the nonsense that is on so many CDs today. This is real m",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Anti Trump Riots Minneapolis Special Snowflake Communists Party Gather in Circle of Oppression LOL: via",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "Bob Dylan performs the full version of his 9th highest charting single, Hurricane live and uncensored in 1975 -",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "overall very good for what it 's trying to do . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "the title of the disk pack is totally wrong.It should be Blue Ray + DVD and digital copy available for DLa 210gb download to get the digital copy instead of including it, to me is lame.you enter a very long url, then input the code and start the download managerafter it is finished you have to enter the long url again when you try to play the movie, and get a error 404 website not foundI can get to any other web site I enter, but not to the Transformers site so now the digital copy will not play",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "I love all of Clifton Webb films, this one really extracts his serious side of acting. great film of the era, he is truly the one of the best actors of his time.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Bottom line: Scott's has a matzo ball soup so good I can't imagine how anyone could ever hate the Jews. Best bagels in Phoenix, hands down. Take your Einstein's and shove it.\\nScott's has an expansive menu that ranges across breakfast, traditional deli offerings, and a strong but semi random assortment of 'home cooking' type meals that your mom makes but you never see in restaurants. I haven't spent a lot of time in delis in New York, but Scott's reminds me of the \\\"\"New York deli\\\"\" I used to l",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "This arrived in a different package and bottle than shown. The box has tear marks and is beat up. It also has a nasty, dirty spot where some sort of sticker was removed. What a great looking Christmas gift this will make.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "Wait 20 mins to get a parking spot then wait 15 for a machine no thanks. Just cancelled and move to Fitness Connection for $10 bucks a month. For that price I can go to a swanky yoga studio on the weekends and still be cheaper than the Y. This place is seriously over sold. Stop selling more memberships when you don't have enough space or equipment to accommodate current members. Serious over crowding issue.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "@user @user @user See! I knew I read that wrong. Yay gun control!",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "i 'm just too bored to care . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "combining quick-cut editing and a blaring heavy metal much of the time , beck seems to be under the illusion that he 's shooting the latest system of a down video . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "This is your basic Ulta- not the big one with every bell and whistle.  BUT-- they are in the neighborhood and there's a lot to be said for convenience.\\n\\nThe employees are friendly, and generally leave you alone.  If you need help, however, they are genuinely helpful.  \\n\\nIt's clean and well organized.  If I need a last minute \\\"\"emergency\\\"\" gift (translate: teenage girl birthday)... I can count on getting something that will be a hit.  \\n\\nPlus:  LOTS of sample size / mini items, great nail ",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Wanna know how to tell when your lunch salad is REALLY good?\\n\\nWhen you \\\"\"drool a little bit\\\"\" in between bites, like I did today with my Chopped Turkey Salad from La Grande Orange.\\n\\nI went there on Sunday 10-24, and to be honest, the setup is a little confusing for newcomers.  Order on THIS side, pickup food on THAT side, come back to THIS side to get dessert.  It's enough to make you want to just get in the car and drive home.  But DON'T !!!\\n\\nIf it weren't for the \\\"\"Drool Event\\\"\" whic",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Very disappointing! There are much better places to go for bagels and breakfast stuff.The service is lacking both in efficiency and friendliness. Actually the girl behind the counter was rude and discourteous.\\nThe food was just ok nothing special\\nThe best thing about eating there is I don't ever have to eat there again\\nCan't imagine they'll be in business for long\\nYuk :(",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "@user The Obama Admin is forcing products from non-industries on us. Remove subsidies and no solar, no biofuel, etc.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "you will emerge with a clearer view of how the gears of justice grind on and the death report comes to share airtime alongside the farm report . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "the words , ` frankly , my dear , i do n't give a damn , ' have never been more appropriate . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "@user Donald Trump needs this idiot for his nomination to his cabinet what a joke",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "@user @user so much for @user austerity for worse off, transforming deficit into surplus, lowering uk overdraft",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "See you kids tomorrow #blackfriday #blackweek #podesejogar #dobre #mordki #unitednations…",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Hairspray Live! Previews at the Macy's Thanksgiving Day Parade! #arianagrande #televisionnbc",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "the magic of the film lies not in the mysterious spring but in the richness of its performances . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "I picked this book up thinking it would be good (yes, I judge books by the covers). It was awful...I am not sure why I even kept reading it all the way through. There is no action or anything. He and his brother are poor, his brother gets girls (he doesn't)...boring..boring. I don't even know what the author was trying to communicate with the audience. If you don't want to waste your time, don't read this book.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "Decent drinks + chill atmosphere + Irish Nachos (oh God yes) + lack of sketchy people grinding on you = WIN.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Wizarding Week in Review, click the link for more! #simplypotter #harrypotter…",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "the weight of the piece , the unerring professionalism of the chilly production , and the fascination embedded in the lurid topic prove recommendation enough . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "a very well-made , funny and entertaining picture . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "Only people in the place and the waitress messed up a simple order. Chili verde was ok but not worth $11. Husband had chicken & cheese enchiladas and said they were bland.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "seldom has a movie so closely matched the spirit of a man and his work . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "burns never really harnesses to full effect the energetic cast . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "We could not be happier with what Desert Gardens did for us. We completely relandscaped front and back and (much to my surprise) added a waterfall that we just love. They were incredibly adaptable and their follow up excellent. Our place looks fabulous!! A great experience!",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "while the resident evil games may have set new standards for thrills , suspense , and gore for video games , the movie really only succeeds in the third of these . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "this flick is about as cool and crowd-pleasing as a documentary can get . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "Which is his right. In several instances people have put digs against Obama in their obits. Rightists I guess you'd…",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "YAAY @user !! You fought for us; we are fighting for you! #StillWithHer!!",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I too bought into the hype that the emarker presented, but after using it for a week I realized how pathetic this product is. Its nothing more than a clock that marks the time of day you here the song and NOTHING ELSE! You have to look up everything manually including the radio station and the appropriate time. Not only that but you have to memorize which mark stands for which station, it doesnt even do that!! How stupid, does sony believe they can just sell products by putting their name on it.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "yakusho and shimizu ... create engaging characterizations in imamura 's lively and enjoyable cultural mix . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "#SandyHookPromiseGun control will not work, I live in a place where it's harder for an illegal to get alcohol vs a gun (or several).",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "The cheese counter and \\\"\"Dear Heart\\\"\" really are treasures.  They have all manner of fancy aged gruyeres, tons of olives, and even some sort of disgusting concoction called \\\"\"pepperoni cheese\\\"\".  In any case, the place is all kinds of old-world beautiful.  Shelf after shelf of yummy goods, Italian imports...yum.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Pampers and Huggies are, in our opinion, the best diaper brands out there. We have a slightly preference for Pampers because they look less \"bulky\" on the baby, compared to Huggies or store brands. And it is the best deal I have for diapers, considering the 15% discount from Amazon \"Subscribe & Save\" program. However, I've noticed that the diaper is no longer available as a \"Subscribe & Save\" item, so I am not sure whether I would buy it for the full price - I would have to compared unit costs u",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "harrison 's flowers puts its heart in the right place , but its brains are in no particular place at all . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "This brueggs kinda sucks. Every time I've come they are out of multiple kinds of bagels so someone isn't doing their counts correctly (use to work at a brueggers). The service is lousy. Also apparently brueggers discontinued sprouts-not this stores fault but wtf?! Sprouts are awesome. Going to Poppy's next time.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Our #MannequinChallenge it's only 10 secs tho 😂😂😂",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "And so....the search for a new hair salon continues. Sigh. Don't get me wrong, the cut was a good cut. The salon itself was clean and stylish. The owner, welcoming and friendly. \\n\\nNow what went wrong. The cut was good, but it certainly wasn't what I expected from a salon with the reputation of Izzazu. I wasn't bowled over by my stylist's professionalism either. Don't diss my previous stylist....she rocked....you don't do yourself any favors by knocking someone else.  (And come on, I was WAAAYY",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "AVOID THIS PLACE LIKE THEY SERVE SALMONELLA!!!\\n\\nOur dining experience at this restaurant was the worst I can remember!  We sat for over :15 minutes with no waiter and only after we went to the hostess did the waiter show up.\\n\\nI ordered what the waiter claimed was their \\\"\"signature\\\"\" dish, Paella Latorre.  It was served with ice cold mussels and the entire dish was less than warm.  I called over the waiter and explained.  :15 minutes later he returned with the dish and claimed the chef had ",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "I do love \"Charlie Brown's Christmas\", a joy for the entire family, young and old. A Christmas play is being directed by Charlie Brown, and everyone is complaining. Charlie is sad because he doesn't know the true spirit of Christmas, and his friend tells him the spirit of Christmas. The play was never finished though.I like this toon because \"Charlie Brown's Christmas\" had the guts to tell about Gabriel telling the shepherds about the Good news that Baby Jesus was born in the manger. I would rec",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "the quality of the art combined with the humor and intelligence of the script allow the filmmakers to present the biblical message of forgiveness without it ever becoming preachy or syrupy . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "I am extremely proud of you, Clay...Your album is everything I expected and more !!! I was very impressed with your songs and \"always\" with your amazing and beautiful voice. God has truly blessed you with a gift and a beautiful soul !!! I am proud to shout to the world \"I am a Clay Aiken's Fan...and he is my American Idol\". Keep up your good work, in all that you do.You are an AMAZING person. I look forward to ALL of your albums.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "And now it's time for #ScreamQueens😈💉🏥🔪#CrazyHester ❤️",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Daddyyyy👅🙈💕#MPN #OneDirection",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I have read enough to know when I'm being preached to, and Huxley is unsuccessful in masking his assertions re: the human condition in The Island. I was very disappointed, since Huxley has the ability to write well, even about esoteric subjects (see The Perennial Philosophy, for instance), but ends up just making a hash of it here. Not highly recommended.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "I ordered a pizza and salad for delivery from GrubHub. While my delivery showed up on time, my order was wrong. The pizza was missing 2 of the toppings I was charged for and was under-cooked. Additionally my salad came with the wrong dressing. The experience was disappointing. It's the small things that make a difference and Streets of New York dropped the ball tonight.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "wince-inducing dialogue , thrift-shop costumes , prosthetic makeup by silly putty and kmart blue-light-special effects all conspire to test trekkie loyalty . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Maybe I'm doing it wrong. Maybe I'm just taking crazy pills (you can buy a bottle of 10,000 for $6 at Costco)... but I hate this place. \\n\\nI break out in hives every time I think about having to go here... So then why do I go here, you may ask. The same reason as everyone else. The same reason listed in all of these glowing reviews... to save a little bit of money.\\n\\nI come here for almost the same thing every time. Diet Coke, allergy meds and giant bags of frozen chicken breast. Those are my ",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "AI is changing the world.kudos to Deep learning !",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "#Eurozone Listening to leaders talks reminds KCNA of just how inferior they are in the shadow of Kim Jong-un (praise be) #SydMUN16",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "a movie that successfully crushes a best selling novel into a timeframe that mandates that you avoid the godzilla sized soda . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "When scoping around online for a good NYE dinner destination for my husband and me, Casbah's prix fixe menu really jumped off the page! Since the Big Burrito group is so popular, I was happy to get reservations, especially since a lot of times were already booked.\\n\\nThe hubby and I arrived a few minutes early for dinner. I had planned additional time to park and was delightfully reminded that Big Burrito restaurants have free valet parking -- so great, especially with slushy snow on the ground!",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Get the new york strip sandwhich for lunch, awesome. Great business lunch place",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "do not see this film . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Good morning! ❤️ #ScreamQueens",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I've had my 940MW for over a year. When 1st received, after turning on, it would work for 5 to 10 minutes and then cut off. I tried removing and re-pluging in the power cord and it would work for a few minutes and then the monitor would again cut off. Then I tried a different approach. I removed the power cord and squeezed the end that goes to the monitor with regular pliars. SINCE THEN, THE MONITOR HAS NOT 'TURNED ITSELF OFF' ONCE!I believe that what was happening, in my case anyway, was the po",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "I was unable to get this game to work in Windows Vista. I inquired about a patch but did not receive a response.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "The Winds of light books are great! This one is no exception, but I like the first 6 the best. The only reason I gave this book a 4 star rating is because the other 6 were better. I would of gave it a 5 if I had not read the others.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "I'm seriously so over sprint. Spotty coverage, half the time my apps don't work because of low coverage... dropping calls, etc. Not to mention messing up payments and bills.\\n\\nTonight, however, I'm livid. My iphone died and I plugged it into my charger for 30 minutes. No luck. I tried two other chargers and still nothing worked. So I took it in to the store.\\n\\nSome employee with blondeish hair and black rimmed glasses came up and immediately acted annoyed he even had to help me. I explained my",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "though perry and hurley make inspiring efforts to breathe life into the disjointed , haphazard script by jay scherick and david ronn , neither the actors nor director reginald hudlin can make it more than fitfully entertaining . ",
      "label": "negative",
      "domain": "movies"
    }
  ],
  "val": [
    {
      "text": "Might not be the easiest location to visit or see, but it's a good option because of the people that work here.  Tucked away across a parking lot and underneath an overhand is this Showmars location, but there are a lot of regulars that frequent this place.  The servers and folks running the register are super nice and they recognize you, call you by name, and ask how your work day is going.\\n\\nI take my lunch around 1pm so WAY after the lunch rush, but I can imagine this place being super busy.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "it 's hampered by a lifetime-channel kind of plot and a lead actress who is out of her depth . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Bought an item from there, didn't notice it was an open item until i checked out. Took it back 5 days later because one of the buttons didn't work, and they refuse to take it back claiming i dropped and damaged it. I never dropped it, i brought it back to them in the same condition they sold it to me as.  Then the manager told me we would not have sold one in the condition. But they sure sold it to me. BUYER BEWARE.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "the film is powerful , accessible and funny . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "I began attending the Midwife Center for well-woman care about three years ago, then chose the Midwife Center as my care provider when I became pregnant with my daughter a year and a half ago.  I can't say enough good things about this place, from the inviting atmosphere to the knowledgeable and supportive midwives to the very helpful nurses and lactation consultant.  My daughter was born in the Forest Room, and it was everything I'd hoped for.  One of the saddest parts about leaving Pittsburgh ",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "When I started reading the book at school I found it boring. I had to read it for school (if I didn't read it I would had a 1) and almost all the class found it boring. It's funny when Leenie (principal characters who does stupid thing. George say's in one part to the owner of the ranch \"I'm not saying he's bright, he ain't, but he's as strong as a bull.\") but the theme doesn't make it a pleasure to read. The book is easy to understand and doesn't have difficult words. The story is about to peop",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "I'd like to have lived in the time when bob dylan was at the top of the charts",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "altogether , this is successful as a film , while at the same time being a most touching reconsideration of the familiar masterpiece . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "director of photography benoit delhomme shot the movie in delicious colors , and the costumes and sets are grand . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "Big waste of money! After washing noticed 1 pillow case was a different shade and so wrinkled no matter what I've tried. Stuck with it since I washed and can't find packaging.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "Hello Champions, this IS NOT an OFFICIAL 2 Skinnee J's Digital Download! Support THE BAND by downloading it from the band's official website webstore (2SJ.com) where it's available for LESS MONEY and in Hi-Res format!-=AA/2SJ",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "Wow..never thought there is a difference between dive bars and found out there is a big difference.  This place should be categorize as a shit bar instead of a dive bar! \\n\\nCalled about 1:30 and ask about employment there and was told by some bitch working there said \\\"\"no we are not hiring\\\"\" and then with her stupid uneducated trailer trash bitch attitude ass added \\\"\"if you are in the business,  you should know not to call during lunch!\\\"\" \\n\\nIts 1:30, past lunch time \\\"\"rush\\\"\" and this bi",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "This is a really good cheesy movie that girls and guys will both like. However if your boyfriend doesn't like these types of movies then put in the \"unrated version.\" In the regular version the kissing/sex scene doesn't show anything but the unrated version shows lots of skin and is pretty steamy. It's definitely a cutesy movie, but the eye candy and bar scenes will keep the guys watching. Piper Perabo and the rest of the girls won't disappoint I promise!",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "not since japanese filmmaker akira kurosawa 's ran have the savagery of combat and the specter of death been visualized with such operatic grandeur . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "Thanksgiving leftover mashups are my faaaaav. One big holiday garbage pile of awesomeness.#ScreamQueens…",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "This place is an embarrassment to mexican restaurants. The food here is terrible! Here's what we ordered:\\nCombo taco/enchilada / oily taco, diarrhea enchilada \\nGreen chilie burrito / the tortilla was plastic and the filling was gross.\\nTaco salad / bunch of stuff with zero taste. Should have grazed in the planter.\\nThe beans and rice? Really? They couldn't even get that right. Under cooked bland rice and under cooked beans.\\nThis place sux!\\nBeer is good.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "this is a winning ensemble comedy that shows canadians can put gentle laughs and equally gentle sentiments on the button , just as easily as their counterparts anywhere else in the world . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "Bob Dylan sings Like A Rolling Stone live at The Desert Trip  at Coachella on October 14, 2016 -",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Normally I love this place but today management failed. They were understaffed to a criminal degree which is bad for employees and patrons. Its not like the Derby came as a surprise.\\n\\nNever coming back for a special event here. I did go to the 7th St and Union Hills location for Preakness and had a MUCH better experience. Get your act together on 16th St and I could be persuaded to try again.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "We go there for most of our fresh foods, it doesn't have the feel of a neighborhood grocer but the quality and selection are terrific.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "this is a good script , good dialogue , funny even for adults . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "I arrived with my three year old asleep in her car seat.  She was probably out for the night.  I promptly woke her up and after passing a rather large bull we entered the cave.  A few more turns and we entered the restaurant on the second floor.  At this point, we were given the choice of slide or stairs down to the dining area.  I parted ways with my daughter at this point.  I didn't need The DVD player to entertain her this meal, the slide entertained her till the food arrived.  She came back ",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "it 's a cookie-cutter movie , a cut-and-paste job . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "ewww.  didn't like this place.  the neighborhood was iffy and i was scared to leave the hotel after dark.  the room was dated but clean.  won't be back.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "@user @user @user @user You're the one who brought up Obama. I'm going to miss him. 💙💚💛💜 #ThankYouObama",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "there 's not enough here to justify the almost two hours . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "@user @user #MannequinChallengeNailed it !",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Insane Moore calls on Dems to do \"whatever needs to be done to stop this appointment.\" This is \"third-world\" crazy",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "one long string of cliches . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "We bought a home and shortly thereafter found there was a fairly significant scorpion problem. We had an exterminator out SEVERAL times with little relief. We went to Bug & Weed Mart, got a free consultation at the store and purchased the recommended products. WOW! What a difference. Our scorpion problem is almost completely eradicated. We have nothing up on the house. We only found one on the edge of the property where it wasn't treated. We're very happy. There has been no critters inside the h",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "the whole city watch series is just about my favorite bunch of books I have ever read. I almost have to read them alonme because I get the whole family looking askingly when I laugh out loud. Great stories, obviousl;y fantasy but so real. And if you love word play you will never find better",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "@user The @user once labeled Dr. Ben Carson as an extremist which took away the little credibility they still had.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "the inspirational screenplay by mike rich covers a lot of ground , perhaps too much , but ties things together , neatly , by the end . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "I've never eaten at Hardee's.\\n\\nI've been to Hardee's twice. Once was waaay back in 2008 or so, when I went in and ordered some chicken tenders. They told me they were out of chicken tenders (?) so I'd have to order something else. Pass. I've been avoiding it ever since.\\n\\nYesterday, boyfriend and friends wanted Hardee's. I figured it was time to let bygones be bygones, so I went to Hardee's and ordered the three-chicken-tender combo basket with curly fries and a drink. The girl behind the cou",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "that 's a cheat . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "I love this group's early feel-good canadian rock n' roll, but I stumbled onto this album in a music store in the mall. With excitement, I sampled all the songs and to my disappointment, I still can't figure out what the hit was suppose to be. It's really terrible so don't bother. Just stick to their old stuff. Their 80's stuff rocks!!",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "First things First...\\n\\n\\nLOCATION: \\n\\nCamelback Barber Shop is not easy to find if you don't know where you're going. It's located in the Camelback Colonnade shopping center. More specifically, it's in the alley between the Hallmark store and ULTA, which even More specifically, are located next to Michaels Craft store. If you don't find it with those instructions... I can't help you.\\n\\nThe rest of the story:\\n\\nPrior to today, I've had one haircut in Phoenix. It was in Arcadia and the place ",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "I have been using this product for a couple years now. I started using it because my hair had gotten so dry from all the chemical treatments and relaxers. This actualy came in the relaxer kit. I tried it and could not beleive the difference it made with one use. I could not find it in any of the stores at the time so I searched Amazon and they had it. I absolutely love it. It is the best moisturizing product I have used so far. My hair is soft with good elasticity and it is not breaking anywhere",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "@user @user @user @user they're stupid then. Minimum wage, tax credits, new hospitals & schools. All Labour.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "his comedy premises are often hackneyed or just plain crude , calculated to provoke shocked laughter , without following up on a deeper level . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "My almost-5-month-old has never had any diaper other than a Pampers diaper on his body! I swear by Pampers!But, even though they are less expensive, the Baby Dry type are not worth it! I found them cheap looking and feeling (they could have been mistaken for a store brand.) The absorbancy in the seat of the diaper was so bad, my son would wake up from a short nap and the seat of his outfit would be wet (there was not a fit issue, he was the correct weight for the size I bought, and the leakage w",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "So far I really like it. It's very informative and useful. I would have given 5 stars but I have it on Kindle and in hindsight would have rather gotten the book in paper. It's difficult to \"flip through the book\" and find what you need. But I am fairly new to Kindle so maybe it's just me. Or old fashion enough to prefer a book in hand. But I do recommend it in whichever form you prefer.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "not really what i wanted xxxxv xxxxx xxxx xx xxxxx xxxxx xxx xx xxx x xxxxx xxxx zzzz zzzz zzzz",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "it offers little beyond the momentary joys of pretty and weightless intellectual entertainment . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "an operatic , sprawling picture that 's entertainingly acted , magnificently shot and gripping enough to sustain most of its 170-minute length . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "Yes it is a chain but some chains are good!  The only reason I didn't give the Palm five stars is because YOU NEED A 6 OZ STEAK.  Us chicks can't handle 9 ounces!!!  \\n\\nI love the fillet - I get it with the Oscar option and I can't talk or think about anything else while I am eating it.  Perfectly cooked (I like medium-rare), perfectly seasoned (slightly salty!!), perfectly served in a little bit of au jus.  I had happy dreams for days....sigh....  \\n\\nThe app we got was the bacon-wrapped scall",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Fidel Castro dies. Cubans rejoice, but #AndreaMitchell cries. Liberals are the worst society has to offer.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "I saw this movie when it first came out, it was hauntingly beautiful. I am so happy to get it on DVD. Some may find it a little slow in areas, but I loved it. If you appreciate the work of David Lean, and the acting of Sarah Miles and Robert Mitchum, then you will love this. It ranks right up there for me with Dr. Zhivago, which I also had the pleasure of seeing when it first came out on the big screen. A wonderful epic movie. The seller was extremely prompt and made the purchase feel as though ",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "@user fantastic!  Gotta love then\"Rightists\"",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "@user Hey Liz, the People are despairing at all this Russian hacking stuff - can you let us know you're working on it?",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "Trout Fishing In America make kids music, they do it well, and the album probably will stand up to the death play the kids will give it, even with adults, although I highly doubt many adults will listen to it for it's own merits. If you need a CD for your kids to listen to that won't drive you crazy, you have found it, but otherwise this is probably not a CD you want to own.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "it 's like watching a nightmare made flesh . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "@user it's delicious, but still not as good as Kim Jong-un's suave lisp. Yum.",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "a romantic comedy enriched by a sharp eye for manners and mores . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "I wasn't sure how I would react to this CD. It's not the usual style of music I listen to, but I love Clay Aiken's voice. I was pleasantly surprised. This CD rocks! My favorite song is Shine. I can't get it out of my head. I also love Measure of A Man and I Survived You. Yay Clay!",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "love it.  i have been comming here with the rents since i was little, so its nostolgic for me.  i still get the same thing, a scoop of lemon on top of a scoop of chocolate in a waffle cone.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "this DVD is a good show. it is good to see DVDs still widely availible. DVD is able to have true stereo, and, or sourround sound.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "It was a decent book, but not a lot of new information for me. For the most part, it simply confirmed some basics I have long believed in - not living out your dreams through your children, encouraging exploration without forcing achievement, the need to provide for additional means of learning, etc. A lot of time spent on selecting schools for gifted kids, which really doesn't apply in small towns like we live in. Some good chapters on different kinds of gifted children and some scattered teach",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "it's time! #fantasticbeasts 👌",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Horrible service. I bought a $400 belt for a buddy of mine for his birthday and he went the next day to get a bigger size, never wore it or even really touched it. They told him they couldn't exchange it because it seemed a bit bent like if it was worn.\\n\\nMoreover, the customer \\\"\"service\\\"\" salesperson brought the belt into the back room and came back with an obvious new hole in the belt. She said that we did it, even though they gift wrap the box and we didn't even touch it after buying it an",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "I thought the book was good to read. It gave me an idea of how the world really could be if it wanted to. I enjoyed reading it. I kept me in suspence.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Ordered on same day as Tivo but came 8 - 10 days later. Caused a delay in hooking up. It would helpful to ensure shipping at the same time, especially when one unit is dependant on the other. Unit dropped off line after the first installation and had to be rebooted. Seems to be OK now.This is my first Tivo and adapter so I have nothing to compare this product with.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "To the tune of \"Whistle While You Work\":Mike Pence is a jerkSteve Bannon is far worseDonald TrumpBroke his rump andNow it doesn't work",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "I love Postino. I just wish it was closer. It's a great place to go after work with a few friends for drinks, but then I gotta drive home...  The $20 deal for wine and bruschetta is as good as everyone says. The prosciutto with figs bruschetta is so delicious, the salty flavor of the prosciutto combined with the sweetness of the figs is heavenly. I also love the smoked salmon and pesto combination. If you're a little hungrier and want something to yourself, the paninis are extremely satisfying. ",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "the longer the movie goes , the worse it gets , but it 's actually pretty good in the first few minutes . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "@user What makes Steve Bannon racist?",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "the film makes a fatal mistake : it asks us to care about a young man whose only apparent virtue is that he is not quite as unpleasant as some of the people in his life . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Really marvelous art presented in a beautiful setting.  The gift shop is one of the best in the city.  They feature crafts from artists around the world and local.  Shows are well lit and well presented.  Downstairs are studios where they teach classes on metals, wood, fiber, mixed media and book/paper arts (beginning to advanced). They do a great job of hosting outside events and fundraisers.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "White House staffers stage a 'protest' against someone pooping in their oatmeal. Also strongly blame Trump for Hill…",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "Conflicts are only 1 of many issues facing racist/sexist/abusive/narcissistic despicable Trump. He also violated US…",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "a difficult , absorbing film that manages to convey more substance despite its repetitions and inconsistencies than do most films than are far more pointed and clear . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "stealing harvard is evidence that the farrelly bros. -- peter and bobby -- and their brand of screen comedy are wheezing to an end , along with green 's half-hearted movie career . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Day after Thanksgiving Fish Fry remains a fantastic idea #upnorth",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "In this movie, as with life(usually),our \"plans\" from our \"beginnings\", don't work out like we think they will.[If yours have and you are one of the those living your dreams, twenty, fifty, etc. years later, I'm sure you are counting your blessings! ;)]Frances' \"new\" story begins when she acts on instinct instead of \"planning\" and thus life begins, rather unexpectedly to Frances, to have its own \"design\" for her life. She has her hopes and dreams for what her life will become. Little does she kn",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "the film tries too hard to be funny and tries too hard to be hip . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "without ever becoming didactic , director carlos carrera expertly weaves this novelistic story of entangled interrelationships and complex morality . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "@user Yes, responsibility is key. Michael Moore should've known better.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "This CD has instrumental experimental Jazz and near trance synthesizer pieces. Some of the rhythm patterns have a Latin flavor and feel very danceable. Others remind me of chill out lounge music. A few selections have some subdued vocals that are more part of the background rather than the foreground. I enjoyed the selections and liked working with them in the background. I have not heard the other volumes in the series and so I cannot compare them with each other. My only reservations about thi",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Kinda dumpy, and not entirely in an endearing, it's-an-almost-hundred-year-old-place kinda way.  Service was ok-ish, music terrible (live music Friday nights - not a fan myself).  This place gets 4 stars for the food.  Burger and fries.  Epic win.  Burger with bacon, dried apples (??? I know, right?!) and a huge gob of blue cheese on an english muffin.  Fries were awesome, too, served with a giant cuppa ketchup.  Burger was slightly overdone, unsure whether there was ordering confusion or what h",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Check out this very nice product",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "the fly-on-the-wall method used to document rural french school life is a refreshing departure from the now more prevalent technique of the docu-makers being a visible part of their work . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "@user @user It has helped Seattle, but how to stop insane housing prices? Increasing the minimum wage doesn't seem to be full solution",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "Too long and too precious. This second Narnia film still finds the children in wartime England waiting for a train when they are abruptly called back to Narnia. Hundreds of years after their visit from the wardrobe, once again evil outsiders are threatening to overwhelm the animals and folk of Narnia's forests. The children eventually save the day and return to the train station after heroic battles and soul searching speechifying. Although technically amazing, the story is drawn out to a sense ",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "...and hate it now. My only revenge for being forced to read Tess as a kid is to write a negative review as an adult. So there, that's done.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "I used to love D&B when it first opened in the Waterfront, but it has gone down hill over the years. The games are not as fun and do not give you as many tickets and the prizes have gotten cheaper in quality. It takes a whole heck of a lot of tickets for you to even get a pencil! The atmosphere is okay but it used to be so much better with the funnest games and diverse groups of people! Now, it is run down and many of the games are app related games (Fruit Ninja) and 3D Experience rides. With su",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "I don't get what people like about this place. It's generally crowded with rushed service and the food has yet to impress. I've tried at least twice -- maybe I'm ordering wrong but I really just don't get it...",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "This is the worst film of all time. The only amusement came from making fun of the acting. How they got Liam Neeson and Zeta Jones to be in this movie is incredible. I was looking forward to bathroom breaks so I would miss some of this movie. Total poop!!",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "At first, I was a little confused as to how Hardy could stretch what seemed to be a simple plot into such a long novel--especially because the story in blurb on the back cover happened within the first 50 pages. But the story is more than the blurb on the back cover. It is about betrayal, last wishes, the \"evils\" of drink, and how one mistake can affect you 21 years down the road. Hardy's fatalistic view, seen through Henchard, is, at times, enough to drive the reader crazy.Like many of the othe",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "I miss Karsh's (no longer live in AZ), although I really like Bea's Bakery out here.  Chompies' bakery rivaled them on some items, but Karsh's made the BEST cakes.....I got one for my daughter's Bat Mitzvah.....and smaller cakes for birthdays and such.  Absolutely YUMMMMMMMMY.  Perfect cake, perfect icing.  Great challah, too.  Their other bakery items were also quite good....rugelach, hamentashen, brownies, cookies.  I'm just glad I didn't live close to them when I lived there.  Downside...they",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "I was a little nervous about shopping here after reading the reviews, but since it was closest to our hotel, we gave it a try.  It was fine. Nothing worse than you'd find in the SF Bay Area. Buck up, little campers. Quit being so stuck up.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "The squeem is a great idea but the construction is not the best. While the product compresses your stomach, the inner metal spines bend and then protrude at the ends. I have had to sew the ends repeatedly but the spines keep poking through. At one point, the spine developed some sort of crack and when it poked through the bottom, it scraped my stomach and I took it off immediately. I have never washed the product in the washing machine...I have always handwashed it. So, the manufacturer can't sa",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "If I could give 0 stars I would!  My daughter's prom was after most other ones nearby.  We went here because it was recommended.  BAD IDEA!! She is a size 16.  Certainly not out of the ordinary! Their selection was small.  She found 1 she liked, but it was too big.  Since I know nothing about it, I trusted the saleswoman when she said alterations would be simple.  So we bought it \\\"\"all sales final\\\"\".  We knew of a tailor who is good and trustworthy.  When we showed up for the fitting the tailo",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "the structure the film takes may find matt damon and ben affleck once again looking for residuals as this officially completes a good will hunting trilogy that was never planned . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "Blow it out. The party's over. This candle has flickered and the flame has gone out. Wax on. Wax off. Closed. And for anyone who caught my stand up, yes indeed, I have purchased tapered candles here.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Had a elfin' good time today with Colin. @ 3D Printing by Muckychris",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Jamba Juice and free WiFi.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "@user I have brought this up etc. And Reid demanded info from Comey but he was too busy helping Trump",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "@user @user The same McConnell who was minority leader as Obamacare was passed? Riiiight 😂",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I was disappointed in this book. I am searching for a book that is equally as awesome as 'A Virtuous Woman', but it looks like Kaye Gibbons isn't going to give it to us. In this book the women are survivors because they have to be. I was disappointed in the cold, compassionless character of Charlie Kate. Her character shined through her words and actions: beneath that arrogant surface lay a very insecure, unsatisfied, unfulfilled, and angry person. I can understand why she didn't have a man: who",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "Its #NationalFastFoodDay .. surely that's all the #wednesdaymotivation you need. #getinmybelly",
      "label": "positive",
      "domain": "social"
    }
  ],
  "test": [
    {
      "text": "ICYMI! SO much celeb shade to be thankful for this year!",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I will always trust them with any car I drive.  They are trustworthy and honest!   I have been their customer for years, but there is one time that Gab wanted to take a little extra time to ensure he diagnosed the problem correctly and it ended up costing me a lot less money for an extra 30 minutes of time for him to validate the actual issue.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Good bread, but steakums do not a cheesesteak make. Stick with cold subs.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "One of the few recent films that I anticipated to be good and it exceeded my expectations.Sir Ian McKellen once again performs well. The real surprise here is Brendan Fraser. Thanks to Bill Condon's amazing screenplay, Fraser is study of expressive and innocent contrast to McKellen's anguished and self-defeated character. Make a point to get this one. Best screenplays consist of strong dialogue, pacing, and narrative. The Oscars are usually accurrate about that.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "@user Only because burning fossil fuels never includes the cost of carbon pollution.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "@user @user yeah but Mike Pence got booed",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "I've seen Mad Max dozens of times, but after watching the new SE DVD it was like watching it again for the very first time! That is not an exaggeration. The new DVD offers the choice of the poorly dubbed US soundtrack or the original Australian soundtrack. Watch the original track! The pacing of the film changes entirely, as do the characters. The original soundtrack breathes new life into this film.The features are great, there's a trivia track that pops up info about the production, cars, and ",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "rumor #trump will import the Great Wall of China, and install it on the Mexican Border #maga #Mexicanwall",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "I bought this for my off campus residence, and the two months it worked fine...and then the problems began. First, two the curves on the top (not sure what exactly they are called) merged into one so I had to sleep on one half of the bed. Recently, I noticed it was starting to sink and re-inflated it. Shortly afterward I heard some air and found where it was leaking and didn't think too much off it. Then in the middle of sleeping I woke up on the floor and then just gave up on it, and now am hav",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "The more you know about mountaineering, the funnier you'll find this book. There is little to like, but much to laugh at in Ruth Ann's utterly unselfconscious self-portrait.If this were a comic novel it would be a dead-on parody of a certain strain of self-glorifying mountaineering literature. Think Nicholson Baker writing \"Into Thin Air\" from the point of view of Sandy Hill Pittman. And it starts with the twenty-two-word long title!Warning: if you're not in the mood to laugh, be prepared to be ",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "at the very least , if you do n't know anything about derrida when you walk into the theater , you wo n't know much more when you leave . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "We had to wait about 10 minutes for a table on a Friday night after 7pm.  It would have been a 30 minute wait for an outside table which would have been preferable to us.\\n\\nWent with my son and husband.  I ordered a Mangorita and enjoyed it.  My husbands Pina Colada was also very tasty.\\n\\nHusband got pork tacos and was happy with them.  Son got a teriyaki burger and loved it.  I had a Hula veggie burger and it was good but I was wishing I had ordered the Teriyaki one also.  I ordered the frenc",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "R.I.P. Pats Pizza. So sad we have lost our neighborhood eatery to self demise. After eating from Pats for years with an occasional disappointment my last 3 delivery orders have been inedible. Good Bye and RIP.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "...of one of the oldest mysteries in England was thoroughly enjoyable. The story is told in an intelligent manner and seems to logically solve the mystery. Until I read another theory on these two little princes I find more believable I'll stick with this one!",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Move over Fracking @user @user @user @user",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "building slowly and subtly , the film , sporting a breezy spontaneity and realistically drawn characterizations , develops into a significant character study that is both moving and wise . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "OK i had to write a review because I was very disappointed!\\n\\nI gave this place the benfit of the doubt only because i heard they had a great happy hour and it is a brewery! Plus they only had 3 stars when i looked over the yelp reviews, I wanted to help improve that......Big mistake .....I should've listened to my fellow yelpers. I decided to have my birthday dinner here on a friday, we decided we would meet early for happy hour then move to dining area for dinner. Well my small party of 4 got",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Poor service, long check-in process and time...total hassle. Will never, ever rent from them again.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "I love love loved Edward Lear but unfortunately this free copy doesn't have the marvelous drawings. It would be better to get another edition of this wonderful book, one that is illustrated.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "The book starts with an enticing psychohistory idea, but then it dives deep into politics. It is quite interesting to read the ingenious solutions for the crises taken by the great leaders of the Foundation, specially for resigning war whenever it seemed the most sensible way out.The problem is that this book is supposed to be science fiction, yet the story seemed to have happened back in the mercantilism period in the XVII century, with its priests, kings, viceroys and merchant ships trading ra",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "an overemphatic , would-be wacky , ultimately tedious sex farce . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "My copy even has an arrow pointer on the front cover picture! Talk about lousy merchandising. No Dolby, much less DTS, only a PCM Stereo recording. Video is average. Like proper packaging and presentation were no more than an afterthought.All in all, this looks like a bootleg edition. And no, it's an official release. Amazing. Messy. What were they thinking?",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "Love @user ! We need to see more of her on @user . Maybe replace @user ?",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Wonderfully written and hugely educational, taking the reader from the theory of historical evidence to the stories of King Richard III",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Came here for a drug screen for a new job. Tried to call for 2 days to set up a time to come in. Time is money. Every time I tried to call the number listed the call would ring and then just disconnect. So due to the fact there is a time expiration on the drug screen. Came in to get it done. Show up, find out there is over an hour wait just to pee in a cup. Ask if there is any way I can just go because this whole procedure is going to take less the a minute to do. Ask to speak to a manager. Davi",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "food is still good , slice of pastami n rye is heaven on earth, with dr brown root beer no y ou didn't jgo for the ambience its those delcious heartstoping sandwhciches..and be patient you mave have wait for a table.. but you can always take out..smile",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "the only excitement comes when the credits finally roll and you get to leave the theater . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "SATANIC TEMPLES STRIKES OUT TEXAS LAW ABORTION",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "I called Monday morning during a heat wave and said that our unit was not cooling down as much as it should a hot afternoon.  They said they either could come out in the afternoon or the next day, which--considering we still had a/c and it was cool at night--was fine.  They did keep in touch (it was the next day), and I found the technician to be on-time and responsive.  (Some freon just needed to be added.)  The service call was $65 and the lb. of freon $25, so it was very reasonable.  He told ",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "@user YOURE SO FULL OF YOURSELF! YOU KNOW U NEVER RECEIVED ANY THREATS FROM TRUMP OR HIS SUPPORTERS! MAYBE TH…",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "An excellent book. Kim Newman puts his own spin on a turn around a Wold Newton style universe. He also has a bunch of sneaky 'now who was that' style cameos, a la John Myers Myers' Silverlock.Dracula has found another way to be in charge in England, by marrying in to the royal family. To prevent problems, he has had the Great Detective thrown in a prison camp.So when a serial killed called Silver Knife is killing vampire whores, it falls to the Diogenes Club to investigate. Vampires heal normal ",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "As mentioned by other reviewers, this DVD is just horrible to watch because of the absurd amount that the cameras cut away to another scene every few seconds. If you want to watch a guitar solo or anything else for that matter to absorb any details, forget it! The editor(s) didn't do the Scorpions justice. The music is good, but since this is a DVD and not a CD, I'm giving two stars for the spazoid video technique.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "it 's a beautiful madness . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "The Scarlet Letter by Nathaniel Hawthorne is a great novel. It takes place in Boston, Massachusetts during the era when Puritans were there. The main character Hester Prynne is forced to wear a Scarlet Letter A for adultery because she cheats on her husband while waiting for him to come from Europe.The book really recaptures what Puritanism was like. Its interesting to think about what America would be like if we were still Puritan. A theme of the book is concealed guilt. The minister Arthur Dim",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Since I am a literature student I am a reads-everything-I-can-get person. Having once recognized Pratchetts works, I left all my classic German literature aside and started reading and reading and reading... . But this book, \"Small Gods\", has beaten everything I've read before (even my all-time favorite \"Faust\" - you know: the Goethe one). It is witty, intelligent and above all deaply questioning. I remained nodding all the time:\"Yes, that's what I always believed religion is about.\"",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "sacrifices the value of its wealth of archival foot-age with its less-than-objective stance . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "it provides the grand , intelligent entertainment of a superior cast playing smart people amid a compelling plot . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "I couldn't help comparing this novel to The Book of Ruth. Like Ruth, it is an intriguing look at the life of a girl growing up, and the influence of family members on this growth. But, unlike Ruth, this book is positive. This book is uplifting. This book is a joy to read. This book is about intelligence, wit and love. This is a book I'd like to write! Pick this one up-then pass it along",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "I am very surprised at the 5 starspeople are giving this CD. Pleasedon't waste your money. Clay wasokay on AI2 but this new CD justshowcase his talents. Hopefullynext one will be better. I will haveto give this one two thumbs down!",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "for anyone unfamiliar with pentacostal practices in general and theatrical phenomenon of hell houses in particular , it 's an eye-opener . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "scores no points for originality , wit , or intelligence . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "The Constitution lets the electoral college choose the winner. They should choose Clinton. #StillWithHer",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "... a story we have n't seen on the big screen before , and it 's a story that we as americans , and human beings , should know . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "expect the same-old , lame-old slasher nonsense , just with different scenery . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "This is the solution to the rioters blocking stores  and attacking people on behalf of George Soros's…",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "... plays like somebody spliced random moments of a chris rock routine into what is otherwise a cliche-riddled but self-serious spy thriller . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "I've been to A-Ri-Rang several times now and I have to say that I am not a fan. None of the dishes are particularly great, and I would even dare to say that most are vastly bland by Korean standards (my S. Korean friend really didn't like the beef bulgogi). \\n\\nBeing that it takes a very long time to get your food, and that finding seats for groups larger than 2 people is nearly impossible, I am not likely to return -- There are definitely better Korean restaurant in the extreme vicinity.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "I was given this as a christmas gift, and it's more than lived up to my expectations.It won't heat a cold cup of coffee, but it will keep a cup at a very nice temperature for a very long time.Works best if you actually drink the coffee, the less coffee in the cup, the more effective it is... A full cup of coffee left for a couple hours will moderately warm, but if you actually drink the coffee slowly over time, the end will still be a good temp.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "@user happy Birthday Tipp",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I use to love their concert but tonight it was nothing but soup with large globs of what should have been 'mix ins'.  At over $5 a container it was very disappointing.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Husband was craving Chicken Teriyaki & gyoza, so we found Musashi. I was very unimpressed. We started with gyoza and edamame. Neither were anything special. We then ordered a chicken teriyaki plate and a few sushi rolls. The chicken teriyaki was nothing more than some boiled chicken smothered in teriyaki sauce. Was not good at all. The sushi was mediocre at best. While they were friendly and the service was pretty good - I will not be back.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "@user I think, u know I think I would like to build a wall on the border with mexico, not to let mexican food in",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "Happy #NationalFastFoodDay. 🍔",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I really enjoyed this DVD, it provided good content at a nice pace. I highly recommend this DVD.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "This book was a waste of my time - I bought the bundle and now I'm not going to bother reading any more of Ms Cruise's ghastly stories. The dialogue was atrocious (and not at all amusing), not once did I even crack a smile, let alone laugh out loud, and the plot was so neatly wrapped up that it underscored its decided lack of depth.Agree with another reviewer - if you want mystery and romance, read Janet Evanovich!",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "with the exception of some fleetingly amusing improvisations by cedric the entertainer as perry 's boss , there is n't a redeeming moment here . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "This has been on my AZ bucket list for years and decided to drop by tonight for dinner with the family. From chatting it up with some of the regulars, to the \\\"\"Texas Trivia\\\"\" with the owner at our table. The food and the vibe here were absolutely wonderful. Will definitely be back again and again!",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "i hate US Airways, shitty services",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "ATD has always gone way beyond what is normally expected to help me with my automotive repairs.  They were able to fixed the AC in my truck and get me back on the road within one day during the middle of the summer when I was traveling from Southern California to Utah and then through Phoenix.  They also do great work on the fabrication and repairs for my sandcar.  They are knowledgeable, helpful and honest.  I highly recommend ATD to anyone for automotive repairs and off-road fabrication. Thank",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "huston nails both the glad-handing and the choking sense of hollow despair . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "BED BUGS!!! Horrible place! DO NOT STAY HERE!! Stayed here for a wedding we attended. Woke up in the middle of the night with bites all over my legs, arms, and back. We flip a pillow over and there it was. BED BUGS. We had to cut our trip short. The man at the front desk apologized and gave us the managers name and number and told us to call back later that morning. We have been calling since 8/10 and have yet to receive a call back. Such disrespect. We risk bringing back bed bugs and spending h",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "you do n't have to know about music to appreciate the film 's easygoing blend of comedy and romance . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "ONLY GO IF YOU ARE HUNGRY! We just moved to the area and were intrigued by the sign & the fact the place always seemed packed. Plus we have an affinity for locally owned joints. I ran into to get a couple of cheese steaks one day for lunch...the \\\"\"WHOLE\\\"\" cheese steak is like a loaf of bread. Totally worth it, but we ate them for like 3 meals. Very very good. \\n\\nSo decided to dine in the next time. The large pizza is plenty...really. The wings are above average. We will order them again, but ",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "for all the writhing and wailing , tears , rage and opium overdoses , there 's no sense of actual passion being washed away in love 's dissolution . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "This is one of those rare times that I'm not in line with popular Yelp opinion. Guys, I'm not sure what the heck I'm missing here.  I've tried two Pizzas here: the BBQ Chicken and the Vegetarian. Both pizzas were beautifully presented but they were equally bland as pretty. I must admit the Old World Salad is good but I don't think I'll come back for just the salad \\\"\"shrugs\\\"\". I like the location and the dining room is nice but it' LOUD in here.  I'm just not sure what the hype is about, I thin",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Great place tucked away in 4th ward. You'd never know it was there. Only caveat is that parking is near-impossible. Strict street parking rules make it tough to come here if you're driving. \\n\\nLondon broil Sandwhich was clutch. Good ambiance as well. \\n\\nHope to return soon.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "This is more of appreciation than an actual review.\\nAs a former long time Az state employee health care was extremely frustrating. Now in retirement my medicare supplement is not an improvement. Same carrier, different plan. To find a provider, conservatively speaking, is close to impossible, due to the extremely low provider payments and the fact that the provider listings, year after year are a sad joke.Call ten places from the directory and most are not contracted or wrong address or have no",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "samira makhmalbaf 's new film blackboards is much like the ethos of a stream of consciousness , although , it 's unfortunate for the viewer that the thoughts and reflections coming through are torpid and banal ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Sorry... I gave this album a few spins but I still can't think of a one good thing to say about it. Except maybe that it will probably be the weirdest thing you'll ever hear... can't say it's not original, but in this case that's not necessairly a good thing. If you're not familiar with this band, this probably wouldn't be the best album to start with.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "@user I'm guessing that means valentines??🤔😏❤️",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "the result is a gaudy bag of stale candy , something from a halloween that died . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "My english teacher read this book outloud to us. It was the worst thing ever. I feel asleep every day he read it because it was so boring! It seemed like it took forever to finish so dont read this book unless you want somthing really, really boring!",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "whew god damn lea michele is so sexy #LeaMichele #ScreamQueens #Hester #Booty",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "if you dig on david mamet 's mind tricks ... rent this movie and enjoy ! ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "deliriously funny , fast and loose , accessible to the uninitiated , and full of surprises ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "@user Because in places where your vote is tracked you get a visit the next day from Kim Jong-Un.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "These three discs are a perfect place to begin your Stereolab collection as it covers a wide cross section of \"the stereolab sound\".And the music...??? just look up the individual disc reviews on Amazon.It's all there....Enjoy",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "very bad . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Adios Fidel, hola Cuba libre?: UNITED NATIONS — When Fidel Castro died at age 90, perhaps the greatest achievement…",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "The condition is somewhat less than perfect -- but not much.The book is wonderful. Fascinating story and Very well researched and written.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Why wasn't Adam on this list ? He was on as much as Chelsea ❤️ I miss him #but love #thisisus #yr",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I love watching drunk freshman share the plate of Irish Nachos, absolutely hilarious. \\n\\nBurgers are great, beers good enough for a campus bar. Exactly what you expect.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "I have read all of the Carpathian novels to date, except one. I very much enjoyed them at first, but nothing EVER gets resolved. You would think that after 16 books something would have been resolved and a new obstacle introduced. As for this book, it is an off-shoot of another Carpathian novel about the Jaguar Line. I was hoping to find out more about this curse, the origins and why the males kill the females. Nothing, not a word about the Jaguar curse. And why do the walls and ceilings change?",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "@user has lost the popular vote by the largest margin in US history.  In otherwards, his Presidency is gonna suck.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "The food at this CPK is pretty good.  I guess you could say that for any of the CPKs, but they always do a nice job at this location and are very accommodating of any special requests.  I realize for the relatively low price you pay, you're not getting top-of-the-line cuisine, but it's a great for what it's intended.\\n\\nThe one negative thing I'd say is skip the wine list.  As you can imagine at a strip-center type chain restaurant, it's not exciting, although the staff actually seem to have a g",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "I cannot recommend Foundation, and its entire series, highly enough. When it comes to worldbuilding, and examining the possibilities of earth's future, Asimov does it best. His entire basis is that intelligence, learning, and confrontation of the unknown will be our salvation, instead of ignorance or seeing who carries the biggest gun. A welcome change.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "@user the non equality of votes is an America paradox such as death penalty and racism. Until this isn't fixed America won't lead.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "the wild thornberrys movie is a jolly surprise . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "Only reason I come here is because I get $5 off the total before 9am on Sunday. This recent experience, they forgot to clean the dashboard (dust, dust and more dust) and I almost drove off with the marker of my wash on my windshield?! Those are the two most important parts to clean after a car wash!!!!\\n\\nIf I didn't need to come here, I wouldn't. Plain and simple.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "I honestly don't know much about the Italian referensum, but anything that makes Marine Le Pen happy scares me",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "I love the style of this, but after a couple years, the DVD is giving me problems. It doesn't even work anymore and I use my broken PS2 Now. I wouldn't recommend this, I'm just going to upgrade to a recorder now. I wish it would work but I guess i'm giving up on JVC. I really did like this one... before it stopped working. The dvd player gave me problems probably after a year of having it.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "true tale of courage -- and complicity -- at auschwitz is a harrowing drama that tries to tell of the unspeakable . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "hi i bought this warmer for a vacation trip, i was really dissapointed, it wasnt even 3 minutes that i had it on for the first time and it started to get ON FIRE!!!! melted plastic all over the place smoke like crazy all around the car it is VERY UNSAFE DO NOT BUY THIS PRODUCT DO NOT SPEND YOUR MONEY DONT PUT YOUR BABY IN DANGER IF YOU HAVE THIS PLUGGED IN YOUR CAR, CUS THE WARMER MIGHT GET ON FIRE, MINE DID!!!! i hope this review helps you, i wont EVER buy this product EVER again.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "@user @user chipotle also doesn't pay minimum wage. if you want to form a retarded argument based on assumptions go ahead.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "i really hate to do this, but i have to. service was slower than slow. my bagel + cream cheese was super skimpy on the cream cheese. turkey chili was lukewarm and not as good as it should have been. the staff seemed gloomy and sad. it just wasn't a good experience. it really is too bad, i haven't had lunch at a einstein's in forever and i was hoping it would be as good as i remember it.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "I order the water shoes and was very pleased with my purchase. It is excatly what I wanted and I got it in no time flat. I was a little hesitant about ordering on line but this experience was well worth it..",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "I'm thankful for Grayson Allen as well",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Love this place! The food is delicious. The salsa is fantastic and better yet, they sell it. Took home a pint and plenty of left overs. Knocking one star off because service can be extremely slow at times.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "My little man sleeps 12-14 hours a night, and these are the BEST diapers for leak protection!! If you do the Amazon Mom subscribe & save, it's an even better deal than cheapo diapers! With subscribe and save, I get a box of these each month, delivered to my door. So fantastic & worry free. HIGHLY recommend.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "They're a great local alternative to Starbucks, and they make kickass drinks! I've had mochas here, hot and cold, and chai tea lattes here, hot and cold. All were delicious, about the same price as you would find at Starbucks, but they have those cute little stickers for decorating your cup and I'm all about the stickers. They're usually seasonally themed and are always adorable. It's the little things, people.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "I am a big fan of Ms. Blake's but this was not one of her better books. It dragged a lot at times but the history involved in the story more than made up for it. If you're a fan of people and their cultures, you might want to give this book a try.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "not only are the special effects and narrative flow much improved , and daniel radcliffe more emotionally assertive this time around as harry , but the film conjures the magic of author j.k. rowling 's books . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "too restrained to be a freak show , too mercenary and obvious to be cerebral , too dull and pretentious to be engaging ... the isle defies an easy categorization . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Ok, as yall might know me, im Gamer8. To the game. This game is sorta like the first NBA Street game for the PS2. It has some flaws, such as lighting. Also, at points of the game, you might say, is this game worth $50.00? Well, its worth about $30.00. 1.- Its not a good game for portability. 2.- Lighting is bad at times 3.-Can be hard for beginners. So I suggest that you must know what the first few NBA Street games are about before buying thsi title. PS:Its a fun game after a while",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "My husband and I got more out of this than the free classes the hospital nurses give. We've been able to watch it over for things we missed. There is tons of useful information...too much to take in at once. I love having it becasue if I forget something I just re-watch that section. Its helped us become familar with the terms the nurses use and we have great information for question asking when we go to our Dr. Apts.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "FABULOSO............ The ambiance, the wine list, the cuisine, the service, the views, the romance..... WOW!!!!!!!!! Mere words cannot describe this magical wedding anniversary dinner we had.....",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "I fell in love with clay the first day he auditioned on AI. He is not only adorable he as a AWESOME voice!! girls are crazy over him!! and this CD is SOO GREAT!!IT'S BEAUTIFUL!! I LOVE CLAY SOO MUCH and if u say that you can't stand him then why are you wasting time reviewing over him??JELOUSY!!! : )Keep it up claymates! he has already gone double platinum!!! WOOWOO!",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "Steve Bannon's Face Was on an Ad on Pornhub How Will I Ever Feel Desire Again: An Autobiography",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "****MAJOR SPOILER****DON'T READ IF YOU DON'T WANT TO KNOW****Before I invested time watching this, I wish I had found a review saying there was a death of a major character at the end. I wouldn't have bothered, it wasn't that good anyway. Maybe this review will save someone. Giving it 2 stars because I've seen abyssal films that only deserve 1-star, and this is not that bad.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "feels too formulaic and too familiar to produce the transgressive thrills of early underground work . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Though staff seems friendly, they are not knowledgeable about shipping valuable things, how insuring a package works and completely overpriced. \\n\\nI used their services to ship a sewing machine. They charge $25 to put it in a box and wrap it with bubble tape.  I was charged $136 for postage and insurance (though not enough insurance to cover the machine if it broke while shipping because she didn't know how).  I felt that I was paying way too much but was in a time crunch so I accepted and left",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "We got a big box of \"baby dry\" from amazon. Our experience is that my son's clothes are soaked with just a small amount of liquid. On the other hand, the \"swaddlers\" take on a ton of liquid and my son stays dry as a bone and so do his clothes. We are sending these back as defective and ordering more swaddlers.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "if the movie succeeds in instilling a wary sense of ` there but for the grace of god , ' it is far too self-conscious to draw you deeply into its world . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Lovely Valentines Day Flyer Template #free #flyer #template",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I have read many of Jack Higgins' books and this is the poorest so far, in my humble belief. As I travelled thro' the pages it just got harder and harder to believe the simplicity with which Mr Dillon strolls thro' the events at hand. The story also lacks any imagination and could probably have been summed up in a short story. Mr Dillon is just to sci-fi I'm afraid.There is a quote at the start of the book and as I got near the final chapters, I was starting to imagine that the Author would be w",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "This bed is so easy to use. Just plug it in, turn it on, and walk away. The pump is built in, so you don't have to worry about keeping up with an air pump, using a hairdryer, or finding double D batteries to power your pump.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Voter suppression is the biggest issue. ~the real voting-rights scandal of 2016. This was the first Presidential...",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "@user @user A better plan is just mass euthanasia.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "in all , this is a watchable movie that 's not quite the memorable experience it might have been . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "a delightful coming-of-age story . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "Please don't go here. I'm begging you. I wouldn't wish this place on my own worst enemy. I wouldn't wish this on the girl who cheated on my best friend. This place was a literal nightmare. .\\n\\nI think I've been to Jimmy Wan's 4 times this month, so I was sick of it. Plus I'd heard good things about TaiPei, so I thought I'd give it a whirl.\\n\\nThe service was abysmal - my waiter took 10 minutes to recognize I'd sat down. He was very kind, but only dropped my food off. No \\\"\"how's it going\\\"\", no",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "So TRUE!! #NeverRomney Reject ROMNEY!!! @user @user @user",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "typically i'm not a huge fan of artifact and cultural exhibits.  However, the Heard experience was beyond expectations.   The 7.50 student price was reasonable and we were instantly put on a walking tour around the museum. The guides were excellent and the museum is quite historic.   \\n\\nThe contemporary art pieces are not quite art museum worthy.  However the katina doll collection was awesome.  They have Barry Goldwater's personal collection of Katina dolls on display !    I highly suggest usi",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "a marvel like none you 've seen . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "FUCK BOB DYLAN",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "..   Kim Fatty The Third.    #KimFattyTheThird.. #America is keeping an eye on you. and #KimFattyTheSecond. and #KimFattyTheFirst.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "liotta put on 30 pounds for the role , and has completely transformed himself from his smooth , goodfellas image . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "If you purchase this data cable, you need to know that you will receive no real directions or information regarding what to check if nothing works. As directed, I downloaded all of the files from the SE site (70MB on dial up!), and then downloaded all of the user guides. Everything seemed to install ok, but nothing would make my phone be recognized. After that I scoured the SE site for troubleshooting info on their branded cable-in the hope that something would help me figure out the problem. Af",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "We recently stayed at the resort for a large dance competition.  the hotel was terrific; staff was incredibly friendly and helpful.  Our room was clean and well stocked with a beautiful view.  The water park was well enjoyed by the literally hundreds of dancing kids.  There were many lifeguards and the pools were incredibly clean and well tended.  Service at restaurant was very slow, but the food was good.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "GOP talk of \"millions of illegal votes\" isn't about bragging rights or popular mandates. It's about justifying *massive* voter suppression.",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "This is an awesome book. Kay just keeps getting better and better. It's also fun to see the characters develop more with each book - Kay herself as she seems to be always \"one against the world\", Marino who it appears is heading towards some sort of heart attack, Lucy who seems to be getting more and more quixotic. In this book Kay finds herself smack in the middle of a series of gruesome killings. It appears that a recently executed murderer, who Kay herself has seen on her autopsy table, is st",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "miller is playing so free with emotions , and the fact that children are hostages to fortune , that he makes the audience hostage to his swaggering affectation of seriousness . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "I've heard this restaurant from listening to NPR in Charlotte, so I went and invited some of my friends and decided to come here to check it out. Here are my reviews.\\n\\nVenue - the ambiance inside the restaurant is like being in Japan. If you have a large group of people, your group will be sitting as if you're sitting on a floor, but your not. The sits are elevated and the center piece is wide open. It's a comfortable sitting arrangement.\\n\\nSushi - the Unagi (Eel) was cooked perfectly. The so",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Havin' a bit of fun today! Do you love these guys too!? Have a great weekend! #mannequinchallenge #luketheboxer",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Weird place. Definitely a dive bar. Certainly dive bar customers and decor. The place is tiny with about 50% of the real estate taken over by a pool table. \\n\\nWhy is it so bright!? If you are gonna be a dive bar turn them things down!\\n\\nWith the Swizzle Inn (one of the best dive bars ever) across the street I won't be back.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "it 's not that kung pow is n't funny some of the time -- it just is n't any funnier than bad martial arts movies are all by themselves , without all oedekerk 's impish augmentation . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Proud to support #UnitedNations International Campaign day for the Elimination of Violence against Women.…",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Even a NYer was telling me to get tacos here, so I did. Pretty good. Loaded more than I'm used to. They make their own tortillas which is respectable. It's fun to watch people order tacos here, this is a real taste of Mexico, and it seemed new to half of them. Pittsburgh is a great town because the vendors aren't afraid to give the people something real - they even have tongue. \\n\\nThat chinese food truck across the street though.... it's good, but way Americanized.",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Not impressed!!  If there were 0 stars that's the rating this place would get.  I ordered a cheeseburger and it was worse than what you'd expect from a school lunchroom!   And why is this place called an \\\"\"Irish Pub\\\"\"?  One would expect typical Irish dishes but not here!  I honestly have no idea how this place stays in business.  Sorry, Hartigan's, I won't be going back!",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "#GilmoreGirlsTop4 Lane, Luke, Paris and Sookie are my fav characters besides obvi Rory and Lorelei",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "velocity represents everything wrong with '' independent film '' as a commodified , sold-out concept on the american filmmaking scene . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "I still think this is my favourite Negan moment lmao #TheWalkingDead",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "The store reeks of rotting fish, the security guards watch you like a hawk and the food selection is the worse I've seen in any Giant Eagle in the city.\\n\\nOne plus if you must shop here there are plenty of jitney drivers waiting for you to come out to offer you a ride.  That can be a big help if you are like me and don't have a car. \\\"\"Need a car\\\"\" haha some things about living in the hood just never change. \\n\\nWith this being the closet G E to Downtown and PNC Park and Heinz field I would th",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Pitchers are a different world, my friend Cy Young tells me. Larry Walker is up there. Have to compare stats, and d…",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "zhang ... has done an amazing job of getting realistic performances from his mainly nonprofessional cast . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "they should have called it gutterball . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "I read this entire book from front to back in 1 day. IT WAS GREAT. Full of useful information and makes you feel that you can do this wether your the initiator or not",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "i 'll bet the video game is a lot more fun than the film . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "instead of hiding pinocchio from critics , miramax should have hidden it from everyone . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "1. Luke2. Jess3. Lane 4. Taylor  #GilmoreGirlsTop4",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "@user Hi, Came across and I'm looking for ideas to write a 3D printer proposal. I'm in the EL school LMC. Thanks",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "@user @user @user to Ukraine and their timber; you using them as a resource, you eurohipocrites",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "Love this place! I was visiting Pittsburgh from Houston and we decided to finish off our visit with this museum - or should I say museums. Coming from Houston where we have some pretty good museums, this was a pleasant surprise - really cheap considering you get both Art and Natural History.\\nThe dinosaur exhibit was so interesting and educational.  The gem and mineral exhibit was huge. And the art museum had a surprisingly awesome collection - I was thrilled to see a couple Van Goghs, Monets, C",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "delighted to see my book #Hezbollah positively received in Choice Reviewshttps://t.co/3NhF1ByczD",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "it gets onto the screen just about as much of the novella as one could reasonably expect , and is engrossing and moving in its own right . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "few films capture so perfectly the hopes and dreams of little boys on baseball fields as well as the grown men who sit in the stands . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "@user It probably is, frankly. Possible endgame is to ride the wave of disppointed leftists when it fails.  Use them to push for 1/",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "Stopped in for a quick drink on new years eve about 3 pm . The place was empty . The bartender Chris was rude and very vulger . He made a crude sexual comment as soon as we sat down . We decided to stay for a drink anyway . After going a couple of choices we were told the bar was out of most stock . On New Years Eve ??? The Bartender kept complaining about his job and bosses for the next 10 minutes . We paid for our drinks and got up and left . Might be the strangest employee experience I had in",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Ethnic cleansing is morally wrong and illegal, no matter who is perpetrating it. #IsraeliApartheid #Palestine #BDShttps://t.co/RXe8t1uYIL",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "We recently moved into a smaller place. When my parents came into town, they took my oldest sons room. We needed something for him to sleep on but didn't have much room. This twin airbed by Intex is great! I love the fact that the pump is built in. It doesn't get in the way like I thought it might. My son says it's very comfortable. It's easy to inflate and deflate.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Dropped off my cousin here for their flight to California. The parking is not a hassle and a lot of things has changed since I remembered back in high school. Everything was under construction, caution tape everywhere, and just looked unappealing. Taking the time to actually tour around the place it is pretty nice and impressive. You got a variety of stores, lounging areas, and of course the restaurants. Very nice because it is still improving and still building more restaurants there. \\n\\nThe b",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "it showcases carvey 's talent for voices , but not nearly enough and not without taxing every drop of one 's patience to get to the good stuff . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "The airport is clean and looks like its been recently renovated. I'm not really fond that the rental car location is 10  minutes away though. Also, i dislike how you have to do a full body scan and get your fingers swiped for bomb stuff.. its like... really? out of all the airports ive been to, this is the only one that made me do it. lastly, the US airways employee at the airport booked me the wrong flight.!!! she gave me a ticket but when she put us in teh system, it was to a different place. ",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "This was the absolute WORST book that I have ever read. It the dullest, most boring thing since I learned algebra. After the first chapter, I already wanted to kill myself. But I gave it another chance. And another, and another, and another. I was continually dissapointecd. DO NOT WASTE YOUR HARD EARNED MONEY ON THIS ABORATION OF A BOOK!",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "What pranks will be left for Trump's team? White House Vandalized In Transition, G.A.O. Finds",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "The magazine was in very good condition and had the usual high standard of articles and photos that Victoria magazine has come to represent. I have collected all the previous magazines of the series and still enjoy leafing through them on a rainy day",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Better than most chain pizza, it's ok.  \\n\\nWe got a thin crust, which was nice and crispy, only a little greasy, ok ingredients, not amazing on the cheese, and had kind of a bland crust.\\n\\nI guess that doesn't sound too good, but I really promise it's better than any national chain pizza you'll find in town.  It also has a really friendly, laid-back atmosphere.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "This is a better than average- let's say very solid-  sushi restaurant.  \\n\\nWe had the omakase and had some delicious bite sized courses.  But strangely the little bites never added up to feeling super full (which could be a good thing, but devouring a chocolate pretzel dessert isn't really the perfect end to omakase).  \\n\\nThe miso black cod was excellent, the sashimi was well executed, and clearly the chef had many, many years of traditional sushi training.  But for some reason my socks just ",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "I downloaded the sample and could barely get though the first chapter. The authors writing felt very juvenile and kept mixing American with London slang. Honestly, it was the dumbest book I've tried to read in a long time. At least download the sample first.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "I found the book itself to be interesting and entertaining, however I attempted to write a paper about it for school, but there is no publisher information or translator. I do not suggest this version of the book for students planning to use it in papers.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "@user @user Little early for valentines, but I'll take it! <3",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "@user Instead of building a wall on the Mexican border, can you build one across the @user defensive line?",
      "label": "negative",
      "domain": "social"
    },
    {
      "text": "@user Electoral college was created so that the interests of all states mattered. Trump won the popular vote on the state level.",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "I went to see In the Wake of Bounty (part of Fringe Fest 2011) and besides the show being exquisite, the venue was perfect.  Phoenix Little Theatre is basically attached to the Phoenix Art Museum which means you can stroll about in the little park area before the show. Take goofy pictures with the headless children statues and throw wishing pennies into the fountain overlooked by the uber masculine yet pensive sculpture.  \\n\\n\\nFree and plentiful parking!!!  The theatre is really intimate with a",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "not since tom cruise in risky business has an actor made such a strong impression in his underwear . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "A new friend suggested I check out Rebecca Lynn Studio; he is balding, and said \\\"\"if they can make me look good, imagine what they can do for you!\\\"\"  So I popped in one day for a cut--literally called em up and drove right on over, no wait!  \\n\\nThe place is clean and cute, and they have wet stations which means you don't have to traipse back and forth across the salon for a wash, they just spin you around and viola!  \\n\\nDan cut my hair, and he was friendly and personable.  He really asked me",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "it 's made with deftly unsettling genre flair . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "No, we just stopped serving breakfast.\\nThe only vegetarian lunch item is the cold veggie sandwich.\\nWe're out of wheat bread.\\nI *guess* we could toast the bread.\\nAll delivered in a forced-friendly-but-really-irritated manner by an extremely bored woman.\\nOK, at $18 for lunch for two (1 full sandwich of the day, 1/2 veggie sandwich, two pops) I would hope that you are fully stocked, friendly, accommodating and apologetic, and don't intentionally assault my eardrums with shitty country music wh",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "Hot links were very average. Terrible texture.",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "there is nothing outstanding about this film , but it is good enough and will likely be appreciated most by sailors and folks who know their way around a submarine . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "I was hoping for an acid that was convenient to use. Well, this is pretty convenient, just swipe. But it did nothing for me. I wanted to try and get rid of the little bumps clogging my pores and frequent breakouts. However, my skin remained the same. And while it doesn't really have a scent, there seems to be some chemicals wafting off the pads that affected my sinuses because I have quite a sensitive nose. I switched to using them on my back and got the same result, which was nothing. So it was",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "This just in: Houstons is on steroids! Yup, it's true. \\n\\nIf you're familiar with Houston's you're familiar with Hillstone. But, Hillstone is better in my opinion. Why? \\n\\n-Wonderful outside \\\"\"first come first served\\\"\" patio seating with fireplaces \\n-Indoor/Outdoor space for the bar area \\n-A sushi bar (and shockingly really good sushi. We had the mango salmon roll - delicious). \\n-No need to worry about Valet... lots of parking. \\n-Great service.\\n\\nWhat hasn't changed is the menu and the ",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "Let me preface this review with the fact that I'm Chinese and I know my rice.\\n\\nSo after a meeting next door @ Hava Jave (review for that place to follow) a friend and I wandered over to Zen32 for a 10pm snack.\\n\\nBoy was that a mistake.  I normally eat up at Celsius in Desert Ridge so I thought I'd get the same food down here to compare.  \\n\\nA couple of the rolls we ordered:\\n\\nViva Vegas Roll\\nCaterpillar Roll\\n\\nThe service was just fine but honestly, even if I had Angelina Jolie serving th",
      "label": "negative",
      "domain": "restaurants"
    },
    {
      "text": "less dizzying than just dizzy , the jaunt is practically over before it begins . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "involves two mysteries -- one it gives away and the other featuring such badly drawn characters that its outcome hardly matters . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "Honouring the stories & cultures of the Khoi-khoin people with #Vêrlander exhibition in National museum, Bloemfonte…",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "Good quality pork fried dumpling and mongo beef.  Bar service was fast and Efficent.   Good value.  Not a 5 cause dragon eye tea was cold first time around and beef had minor amount of fat.   Fortune was even Postive!",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "the movie is n't just hilarious : it 's witty and inventive , too , and in hindsight , it is n't even all that dumb . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "@user God bless you & Pope Francis abundantly",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "George Orwell's prophetic words are coming to pass right before my eyes; You'd see it too, if you got off the TV and started paying attention to politicians and the laws they're passing.I hope there is a revolution of some sort before this grim forecast is played out to the end.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "#FREE #Uber ride (up to $20). Sign up using this #UberPromo link:",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "uses sharp humor and insight into human nature to examine class conflict , adolescent yearning , the roots of friendship and sexual identity . ",
      "label": "positive",
      "domain": "movies"
    },
    {
      "text": "This is the second HP printer I bought and frankly the only reason I tried this printer was because of the network connectivity. I haven't written many reviews before, but this product is soo bad that I had to add to the list of angry customers. Getting the printer to load 1 piece of paper is a nightmare. Now i get paper jam warnings when there is no paper in the bloody machine. Anyone see office space? yeah after I get my new Canon printer, i will re-enact that scene. perhaps i should record it",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "I have 4 boys and have always alternated (for price) between Pampers and Huggies. Both diapers have gone downhill in the last 6 months. They have less absorbency, the top of the diaper in the front constantly explodes and overnight is out of the option. The strip is not as wide to catch urine, it's been cut down. Constantly waking up with both my twins soaking wet, the diaper has exploded and the more generic absorbing material sticks to everything. We've had to change out the sheets, clothes an",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "The bulb seems ok, the batteries have power, but the laser light does not work.The bulb came in 4days.",
      "label": "positive",
      "domain": "products"
    },
    {
      "text": "Be very specific up front if you need the interior glass cleaned and dashboard dusted. I've unfortunately driven away and not had a decent clean inside of the car. \\nNice staff and hard workers! Be sure to tip the guys up front vacuuming and not just on the tail end... Think about it: which do you think is harder !? lol",
      "label": "positive",
      "domain": "restaurants"
    },
    {
      "text": "#Microsoft joins the #Linux Foundation, showing commitment to open source via @user",
      "label": "positive",
      "domain": "social"
    },
    {
      "text": "you wo n't like roger , but you will quickly recognize him . ",
      "label": "negative",
      "domain": "movies"
    },
    {
      "text": "The content - introductory notes, translation - is great. This is one of my favourite adaptations of the Canterbury Tales into modern English.The Kindle version, however, complete ruins the book. The printed version presents facing-page translation, which works great. The kindle version attempts to do that, having one 'page' after the other, not considering that due to the font-size adaptability, this doesn't work at all.",
      "label": "negative",
      "domain": "products"
    },
    {
      "text": "it seems like i have been waiting my whole life for this movie and now i ca n't wait for the sequel . ",
      "label": "positive",
      "domain": "movies"
    }
  ]
}